app/views/groups/_form.html.haml

SELECT `users`.* FROM `users`
---
      / グループ作成機能の追加時はここにcollection_check_boxesの記述を入れてください
      /= f.collection_check_boxes :user_ids, User.all, :id, :name

SELECT `users`.* FROM `users` INNER JOIN `group_users` ON `users`.`id` = `group_users`.`user_id` WHERE `group_users`.`group_id` = 9
---
          .chat-group-user__name
            - @group.users.each do |users|