app/controllers/groups_controller.rb

  def index
    @group = current_user.groups.order(id: :DESC)
---
SELECT `groups`.* FROM `groups` INNER JOIN `group_users` ON `groups`.`id` = `group_users`.`group_id` WHERE `group_users`.`user_id` = 1

  def create
    # binding.pry
    @group = Group.new(group_params)
    if @group.save
---
INSERT INTO `groups` (`name`, `created_at`, `updated_at`) VALUES ('tech_camp_1', '2018-08-02 04:30:25', '2018-08-02 04:30:25')