app/controllers/messages_controller.rb

  def index
    @message = Message.new
    respond_to do |format|
      format.html { @messages = @group.messages.includes(:user) }
      format.json { @messages = @group.messages.includes(:user).where('id > ? ', params[:id] ) }
---
SELECT  `messages`.* FROM `messages` WHERE `messages`.`group_id` = 9 ORDER BY `messages`.`id` DESC LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1

  def create
    @message = @group.messages.new(message_params)
    if @message.save
      respond_to do |format|
        format.html { redirect_to group_messages_path(@group), notice: 'メッセージが送信されました' }
        format.json
      end

    else
      @messages = @group.messages.includes(:user)
---
INSERT INTO `messages` (`content`, `group_id`, `user_id`, `created_at`, `updated_at`, `image`) VALUES ('じきしょうそう 果樹 俵 渦巻き。', 26, 21, '2018-08-02 02:53:12', '2018-08-02 02:53:12', NULL)
SELECT `messages`.* FROM `messages` WHERE `messages`.`group_id` = 1