app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE (name LIKE('%%')) AND (`users`.`id` != 2) AND (`users`.`name` != 'aaaa') LIMIT 20
---
  def index
    @users = User.where('name LIKE(?)', "%#{params[:keyword]}%").where.not(id: params[:id]).where.not(id: current_user.id).limit(20)